Repository: nive/nive
Catalog: nive/locale/*/LC_MESSAGES/nive.po
Languages: fr

source: <em>Unknown field</em>
fr: <em>Champ inconnu</em>

source: Yes
fr: Oui

source: No
fr: Non

source: Authenticated
fr: Authentifié

source: OK. Data saved.
fr: OK. Données enregistrées.

source: Item exists!
fr: Élément existant !

source: Item deleted!
fr: Élément supprimé !

source: String
fr: Chaine

source: Number
fr: Nombre

source: Float
fr: Nombre flottant

source: Bool
fr: Booléen

source: File
fr: Fichier

source: Text
fr: Texte

source: Datetime
fr: Date et heure

source: HTML Text
fr: Texte HTML

source: Lines
fr: Lignes

source: List
fr: Liste

source: Radio Selection
fr: Choix de sélections

source: Multiple Selection
fr: Sélections multiples

source: Multiple Checkboxes
fr: Cases à cocher multiples

source: Password
fr: Mot de passe

source: URL List
fr: URL liste

source: ID Reference
fr: ID de référence

source: ID Reference List
fr: ID de liste de référence

source: Timestamp
fr: Heure

source: Binary
fr: Binaire

source: List of numbers
fr: Liste de nombres

source: Container
fr: Conteneur

source: Filename
fr: Nom de fichier

source: State
fr: État

source: Select Number
fr: Nombre sélectionné

source: Data Table Reference
fr: Table de référence

source: Data Table Name
fr: Nom de la table

source: Created
fr: Créé

source: Changed
fr: Modifié

source: Created by
fr: Créé par

source: Changed by
fr: Modifié par

source: Title
fr: Titre

source: Sort
fr: Trier

source: Category
fr: Catégorie

source: Workflow Process
fr: Flux du travail de publication

source: Workflow Activity
fr: État de publication

source: Unique ID
fr: ID unique

source: Object ID
fr: ID de l'objet

source: File key
fr: Clé du fichier

source: Internal file path
fr: Chemin interne du fichier

source: File size
fr: Taille du fichier

source: File extension
fr: Extension du fichier

source: Files
fr: Fichiers

source: Key
fr: Clé

source: Value
fr: Valeur

source: User name
fr: Nom de l'utilisateur

source: Group assignment
fr: Affectation du groupe

source: This page lists all administration tools like database export or database schema manager.
fr: Cette page liste tous les tools comme l'export de la base ou l'administration du schéma de la base

source: Administration tools
fr: Outils d'administration

source: This page lists all included views for browsing in readonly mode.
fr: Cette page liste tous les views inclus pour consulter en lecture seule.

source: View Modules
fr: Modules des vues

source: Single Views
fr: Vues uniques

source: Widgets
fr: Gadgets

source: Other modules
fr: Autres modules

source: Roots
fr: Racines

source: Meta fields
fr: Champs meta

source: Tools
fr: Outils

source: Workflow processes
fr: Flux de travail de publication

source: Others
fr: Autres

source: Database Administration
fr: Administration de la base de données

source: Basics
fr: Principal

source: Read only listing of all registered modules and settings.
fr: Liste en lecture seule de tous les modules et options répertoriés

source: Views
fr: Vues

source: Read only listing of all registered views grouped by view modules.
fr: Liste en lecture seule de toutes les vues répertoriées groupées par modules.

source: Database
fr: Base de données

source: No persistent storage for configurations activated. Nothing saved.
fr: Aucun stockage persistant pour la configuration n'est activé. Rien n'est enregistré.

source: Application title
fr: Titre de l'application

source: Application description
fr: Description de l'application

source: Enable workflow engine
fr: Active le flux de travail

source: Enable fulltext index
fr: Active l'index plein-texte

source: Codepage used in html frontend
fr: Codepage utilisé sur la sortie html

source: Database type to be used
fr: Type de base de données à utiliser

source: Supports 'Sqlite3' and 'MySql' by default. MySql requires python-mysqldb installed.
fr: Supporte 'Sqlite3' et 'MySQL' par défaut. MySql nécessite d'installer python-mysqldb.

source: Relative or absolute root directory for files
fr: Répertoire racine relatif ou absolue pour les fichiers

source: Database file path or name
fr: Chemin de la base de données ou nom

source: Sqlite3=database file path, MySql=database name
fr: Sqlite3=chemin du fichier de la base de données, MySql=nom de la base de données

source: Database server host
fr: Hôte du serveur de base de données

source: Database server port
fr: Port du serveur de base de données

source: Database server user
fr: Utilisateur du serveur de base de données

source: Database server password
fr: Mot de passe du serveur de base de données

source: Redirect for portal root (/) requests
fr: Redirection pour les requêtes à la racine (/) du portail

source: Favicon asset path
fr: Chemin d'accès du favicon

source: robots.txt contents
fr: Contenu de robots.txt

source: Login form url
fr: Url du formulaire de connexion

source: Redirect for unauthorized requests
fr: Redirection pour les requêtes non autorisées

source: Redirect on logout
fr: Redirection à la déconnexion

source: User account page url
fr: Url de la page du compte utilisateur

source: user management
fr: gestion utilisateur

source: editor
fr: éditeur

source: Switch location or Logout
fr: Changer d'adresse ou déconnecter

source: Logout
fr: Déconnection

source: Administration sections
fr: Section administratives

source: ${val} is less than minimum value ${min}
fr: ${val} est inférieur à la valeur minimum ${min}

source: ${val} is greater than maximum value ${max}
fr: ${val} est supérieur à la valeur maximale ${max}

source: Invalid date
fr: Date invalide

source: Invalid time
fr: Heure invalide

source: Invalid value
fr: Valeur incorrecte

source: String does not match expected pattern
fr: La chaine n'est pas compatible avec l'expression attendue

source: Invalid email address
fr: Adresse email invalide

source: Invalid characters in string: Only 'a-zA-Z0-9.-_' allowed.
fr: Caractères invalides dans la chaine: Seulement 'a-zA-Z0-9.-_' autorisés.

source: "${val}" is not one of ${choices}
fr: "${val}" ne fait pas parti des choix ${choices}

source: Shorter than minimum length ${min}
fr: Plus court que la longueur minimale ${min}

source: Longer than maximum length ${max}
fr: Plus long que la longueur maximale ${max}

source: "${val}" is not iterable
fr: "${val}" n'est pas itérable

source: "${val}" has an incorrect number of elements (expected ${exp}, was ${was})
fr: "${val}" a un nombre d'éléments incorrect (attendu ${exp}, reçu ${was})

source: "${val}" is not a string
fr: "${val}" n'est pas une chaine

source: "${val}" is not a datetime object
fr: "${val}" n'est pas un objet datetime

source: "${val}" is not a date object
fr: "${val}\ n'est pas un objet date

source: "${val}" is not a time object
fr: "${val" n'est pas un objet heure

source: ${value} is not a dictionary
fr: ${value} n'est pas un dictionnaire

source: ${value} is not iterable
fr: ${value} n'est pas iterable

source: Required
fr: Requis

source: "${val}" is not a mapping type: ${err}
fr: "${val}" n'est pas un type correspondant: ${err}

source: Unrecognized keys in mapping: "${val}"
fr: Clé non reconnue dans la correspondance : "${val}"

source: "${val} cannot be serialized: ${err}
fr: "${val}" ne peut pas être sérialisé : ${err}

source: ${val} is not a string: %{err}
fr: ${val} n'est pas une chaine : ${err}

source: "${val}" is not a number
fr: "${val}" n'est pas un nombre

source: ${val} is not a string
fr: ${val} n'est pas une chaine

source: relative name "${val}" irresolveable without package
fr: le nom relatif "${val}" ne peut pas être résolu sans package

source: "${val}" has no __name__
fr: "${val}" n'a pas de __name__

source: The dotted name "${name}" cannot be imported
fr: Le nom pointé "${name}" ne peut pas être importé

source: ${value} has no ${key} key
fr: ${value} n'as las la clé ${key}

source: ${value} not in reference list
fr: ${value} n'est pas dans la liste de référence

source: Fields did not match
fr: Les champs ne correspondent pas

source: Confirm Value
fr: Confirmer la valeur

source: Password did not match confirm
fr: Le mot de passe ne correspond pas à la confirmation

source: Header 1
fr: Entête 1

source: Header 2
fr: Entête 2

source: Header 3
fr: Entête 3

source: Header 4
fr: Entête 4

source: Text (p)
fr: Texte (p)

source: Formatted (pre)
fr: Formatté (pre)

source: Incomplete date
fr: Date incomplète

source: var msg_file_upload='Delete file. Are you sure?';
fr: var msg_file_upload='Supprimer le fichier. Êtes vous sûr ?';

source: Delete this file
fr: Supprimer ce fichier

source: --disabled!--
fr: --désactivé !--

source: There was a problem with your submission
fr: Il y a eu un problème avec votre envoi

source: Errors have been highlighted below
fr: Les erreurs sont mises en surbrillance ci-dessous

source: Year
fr: Année

source: Month
fr: Mois

source: Day
fr: Jour

source: Confirm Password
fr: Confirmez le mot de passe

source: Fake Mailer
fr: Simulateur de mail

source: No receiver for the e-mail! Aborting.
fr: Aucun destinataire pour l'email ! Annulation.

source: Send mails to registered users
fr: Envoi de mails aux utilisateurs inscrits

source: SMTP host
fr: Hôte SMTP

source: SMTP port
fr: Port SMTP

source: SMTP sender mail
fr: Expéditeur SMTP

source: SMTP user
fr: Utilisateur SMTP

source: SMTP password
fr: Mot de passe SMTP

source: Sender name
fr: Nom de l'expéditeur

source: Sender mail
fr: Mail de l'expéditeur

source: Reply to
fr: Répondre à

source: Receiver role
fr: Rôle du destinataire

source: Receiver User IDs
fr: ID de l'utilisateur destinataire

source: Receiver Mail
fr: Mail du destinataire

source: Ignore notify settings
fr: Ignore les options de notifications

source: Html format
fr: format html

source: UTF-8 encoding
fr: Encodage UTF-8

source: Use SSL
fr: Utilisation SSL

source: Log mails
fr: Log des mails

source: Show all receivers in header
fr: Montre tous les destinataires dans l'entête

source: Debug mode
fr: Mode debug

source: All mails are sent to 'Receiver role' or 'Receiver User IDs' field default value. No external mail address is used.
fr: Tous les mails sont envoyés à 'Rôle destinataire' ou à la valeur par défaut du champ 'IDs utilisateur destinataire'. Aucun mail externer n'est utilisé.

source: CMS Statistics
fr: Statistiques du CMS

source: This function provides a short summary of elements and data contained in the website.
fr: Cette fonction fournie un résumé des éléments et données contenues dans le site web.

source: <tr><th>Elements in total</th><td>${value}</td></tr>
fr: <tr><th>Éléments au total</th><td>${value}</td></tr>

source: <tr><th>Physical files</th><td>${value}</td></tr>
fr: <tr><th>Fichiers physiques</th><td>${value}</td></tr>

source: <tr><th>Physical files size</th><td>${value}</td></tr>
fr: <tr><th>Taille des fichiers physiques</th><td>${value}</td></tr>

source: Json data export
fr: Export des données json

source: This function exports all objects in json format. Optionally as flat list or tree structure. This is not a simple database table dump. Object events will be triggered before exporting data.
fr: Cette fonction exporte tous les objets au format json. En option sous forme de liste à plat ou de structure en arbre. Ce n'est pas un simple export de la base de données. Les évènements sur les objets seront déclanchés avant d'exporter les données.

source: Database connection error (${name})
fr: Erreur de connexion à la base de données (${name})

source: Export as tree
fr: Exporter sous forme d'arbre

source: Export objects as tree structure (contained objects are included as 'items')
fr: Exporte les objets sous forme d'arbre (les objets contenus sont inclus en tant que section)

source: File data
fr: Fichier de données

source: Include binary file data in json export (encoded as base64)
fr: Inclure les données des fichiers binaires dans l'export json (encodé en base64)

source: Database sql dump
fr: Export sql de la base de données

source: This function dumps table contents as SQL INSERT statements. 'CREATE table' statements are not included.
fr: Cette fonction exporte la table des contenues sous la forme de 'SQL INSERT'. Les 'CREATE TABLE' ne sont pas inclus

source: Exclude system columns
fr: Exclure les colonnes systèmes

source: Database Structure
fr: Structure de la base de données

source: Generate or update the database structure based on configuration settings.
fr: Génère ou met à jour la structure de la base de données suivant les options de configuration.

source: <div class="well"> This tool compares the physically existing database structure (tables, columns) with the current configuration settings. The database structure is shown on the left, configuration settings on the right. <br><br> Existing database columns will only be altered if manually selected in the 'Modify' column. Modifying a table may destroy the data stored (e.g if converted from string to integer), so don't forget to create backups of the database before modifying anything.<br> By default this tool will only create new tables and columns and never delete any column. </div>
fr: <div class="well"> Cet outil compare la structure physique existante de la base de données (tables, colonnes) avec la configuration actuelle. La structure de la base de données est à gauche, la configuration est à droite.<br/><br/> Les colonnes actuelles de la base de données ne seront modifiées que si elles sont sélectionnées manuellement dans la colonne 'Modification'. Modifier une table peut détruire les données (par exemple en convertissant une chaine par un entier) stockées (ex. si converties d'une chaine vers un entier), aussi n'oubliez pas de réaliser des sauvegardes de la base de données avant de modifier quoi que ce soit.<br/> Par défaut cet outil va seulement créer les nouvelles tables et colonnes sans effacer de colonne. </div>

source: <h4>Database '${name}' ${host} </h4><br>
fr: <h4>Base de données '${name}' ${host} </h4><br>

source: Modify existing columns
fr: Modifie les colonnes existantes

source: Change existing database columns to new configuration. Depending on the changes, data may be lost!
fr: Modifie les colonnes existantes de la base de données suivant la nouvelle configuration. Suivant les changements, des données peuvent être perdus !

source: Show system columns
fr: Montre les colonnes systèmes

source: <div class='alert alert-danger'>Database connection error (${name})</div>
fr: <div class='alert alert-danger'>Erreur de connexion à la base de données (${name})</div>

source: <div class='alert alert-success'>Database created: '${name}'</div>
fr: <div class='alert alert-success'>Base de données créée : '${name}'</div>

source: <div class='alert alert-danger'>Table update failed (pool_meta)</div>
fr: <div class='alert alert-danger'>Échec de la mise de la table (pool_meta)</div>

source: Database settings
fr: Options de la base de données

source: Configuration settings
fr: Options de configuration

source: Default
fr: Défaut

source: Settings
fr: Options

source: Modify?
fr: Modifier ?

source: <div class="alert alert-danger">No database connection configured</div>
fr: <div class="alert alert-danger">Aucune connexion à une base de données configurée</div>

source: <div class='alert alert-danger'>Table update failed: ${dbparam} (type: ${name})</div>
fr: <div class='alert alert-danger'>Échec de la mise à jour de la table : ${dbparam} (type: ${name})</div>

source: <div class='alert alert-danger'>Table creation failed (pool_meta)</div>
fr: <div class='alert alert-danger'>Échec de la création de la table (pool_meta)</div>

source: <div class='alert alert-danger'>Table creation failed (${name})</div>
fr: <div class='alert alert-danger'>Échec de la création de la table (${name})</div>

source: Modify selected columns
fr: Modifier les colonnes sélectionnées

source: Changes on existing columns have to be applied manually. This will write selected 'Configuration settings' to the database.<br> <b>Warning: This may destroy something!</b>
fr: Les modifications sur les colonnes existantes doivent être appliquées manuellement. Cela va enregistrer les 'options de configuration' sélectionnées dans la base de données.<br/> <b>Attention : cela peut détruire certaines choses !</b>

source: Object dump
fr: Export objet

source: This function dumps a list of all objects found in memory.
fr: Cette fonction exporte une liste de tous les objets trouvés en mémoire.

source: Database json dump
fr: Export json de la base de données

source: This function dumps table contents the way records are stored in json format.
fr: Cette fonction exporte la table des contenus de la manière dont ils sont enregistrés au format json.
